tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/emacs'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'mzyy94/mikutter'
tap 'railwaycat/emacsmacport'
tap 'sanemat/font'

cask 'java'
cask 'xquartz'

brew 'libyaml'
brew 'openssl@1.1'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ansible'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bdw-gc'
brew 'cmake'
brew 'coreutils'
brew 'zeromq'
brew 'czmq'
brew 'docker'
brew 'exercism'
brew 'faac'
brew 'fish'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'icu4c'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'gibo'
brew 'global'
brew 'gmp'
brew 'libtasn1'
brew 'nettle'
brew 'p11-kit'
brew 'gnutls'
brew 'go'
brew 'gtk+'
brew 'heroku'
brew 'hub'
brew 'jenkins', restart_service: true
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'libav'
brew 'libevent'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libident'
brew 'libsodium'
brew 'libssh2'
brew 'libxml2'
brew 'mobile-shell'
brew 'mplayer'
brew 'node'
brew 'peco'
brew 'perl'
brew 'ruby-build'
brew 'rbenv'
brew 'xz'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tig'
brew 'tmux'
brew 'tor', restart_service: true
brew 'trash'
brew 'tree'
brew 'vim'
brew 'wget'

brew 'shellcheck'

# brew 'mzyy94/mikutter/mikutter'
brew 'railwaycat/emacsmacport/emacs-mac'
brew 'sanemat/font/ricty'
cask 'appcleaner'
cask 'dropbox'
cask 'eclipse-platform'
cask 'firealpaca'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'mendeley-desktop'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
